# TASK 4.9 (B) 
# Part 1

#### Table of Content

1. Importing Libraries 
2. Dataframe
3. Checking the Dataframe
4. Data Wrangling Procedures
5. Data Quality & Consistency Checks
6. Combining Data
7. Exporting Data

> ##### D1: Download the customer data set and add it to your “Original Data” folder. (done)

> ##### D2: Create a new notebook in your “Scripts” folder for part 1 of this task. (done)

> ##### D3: Import your analysis libraries, as well as your new customer data set as a dataframe.

## 1. Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

## 2. Dataframe

In [2]:
path = r'/Users/charliegehant/Dropbox/4. Career Foundry/Achievement 4 - Python Fundamentals for Data Analysts/02-2022 Instacart Basket Analysis'

In [3]:
path

'/Users/charliegehant/Dropbox/4. Career Foundry/Achievement 4 - Python Fundamentals for Data Analysts/02-2022 Instacart Basket Analysis'

In [4]:
# Importing dataframe customer data file
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

## 3. Checking the Dataframe

In [6]:
# Finding out the shape of the dataset to get a first idea of what to expect

df_cust.shape

(206209, 10)

In [7]:
# Checking what the dataframe looks like and what the columns are and contain

df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
# Getting a feel for the quantitative data

df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [9]:
# Checking data quality & consistency. 
# Everything looks good, although a bit surprising there are only two categories.

df_cust['Gender'].value_counts(dropna = False)

Male      104067
Female    102142
Name: Gender, dtype: int64

In [10]:
# Checking data quality & consistency. 
# Everything looks ok, although the last category is a little bit random!

df_cust['fam_status'].value_counts(dropna = False)

married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: fam_status, dtype: int64

In [11]:
# Checking data quality & consistency. 
# Everything looks ok, although the data is weirdly equal between categories
# moreover I expected some families to have more dependants.

df_cust['n_dependants'].value_counts(dropna = False)

0    51602
3    51594
1    51531
2    51482
Name: n_dependants, dtype: int64

In [12]:
# Checking data quality & consistency. 
# Everything looks ok, there are 51 states, 
# however the data is again weirdly equal between categories

df_cust['STATE'].value_counts(dropna = False)

Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: STATE, dtype: int64

In [13]:
# Checking the data

df_cust['STATE'].describe()

count      206209
unique         51
top       Florida
freq         4044
Name: STATE, dtype: object

In [14]:
# Checking the data

df_cust['date_joined'].describe()

count        206209
unique         1187
top       9/17/2018
freq            213
Name: date_joined, dtype: object

## 4. Data Wrangling Procedures

> ##### D4: Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.<i/>

In [15]:
# Renaming column to achieve formatting consistency 

df_cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [16]:
# Renaming column to achieve formatting consistency 

df_cust.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [17]:
# Renaming column to achieve formatting consistency 

df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [18]:
# Renaming column to achieve formatting consistency 

df_cust.rename(columns = {'STATE' : 'state'}, inplace = True)

In [19]:
# Renaming column to achieve formatting consistency 

df_cust.rename(columns = {'Age' : 'age'}, inplace = True)

In [20]:
# Checking what I've just done: 

df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [21]:
# Using .map to map the values of 'fam_status' into 'family_status'

df_cust['family_status'] = df_cust['fam_status'].map({'married':'Married','single':'Single','divorced/widowed':'Divorced/Widowed','living with parents and siblings':'Living With Relative'})

In [24]:
# Checking the results

df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income,family_status
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,Married
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285,Single
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568,Married
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049,Single
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374,Married

In [25]:
# Dropping the column 'fam_status' as it is now redondant 

df_cust_clean = df_cust.drop(columns = ['fam_status'])

##### THE FEW QUERIES BELOW BELONG TO ORIGINAL SUBMISSION - NOT THE BEST WAY TO DO IT!
##### IT WORKS BUT IT'S LONGER AND MORE TIDEOUS THAN THE ABOVE

##### Renaming the categories in fam_status column, with .append function

result = []

for value in df_cust["fam_status"]:
  if value == 'married':
    result.append("Married")
  elif value == 'single':
    result.append("Single")
  elif value == 'divorced/widowed':
    result.append("Divorced/Widowed")
  elif value == 'living with parents and siblings':
    result.append("Living With Relative")
    
##### then:

df_cust['family_status'] = result

##### then, dropping the column 'fam_status' as I now have a cleaned new column 'family_status'

df_cust_clean = df_cust.drop(columns = ['fam_status'])

## 5. Data Quality & Consistency Checks

> ##### D5: Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.</i>

In [26]:
# The datatype of the 'user_id' column does not need to be quantitative:

df_cust_clean['user_id'].dtype

dtype('int64')

In [27]:
# I am therefore converting it into a string format

df_cust_clean['user_id'] = df_cust_clean['user_id'].astype('str')

In [29]:
# Checking that my query worked:

df_cust_clean['user_id'].dtype

dtype('O')

In [30]:
# 'user_id' is not part of the describe query anymore as it is no longer quantitative data

df_cust_clean.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [31]:
# Checking for NaN values; there are 11259 first names missing. 

df_cust_clean.isnull().sum()

user_id              0
first_name       11259
last_name            0
gender               0
state                0
age                  0
date_joined          0
n_dependants         0
income               0
family_status        0
dtype: int64

In [32]:
# Isolating NaN values

df_nan = df_cust_clean[df_cust_clean['first_name'].isnull()]

In [33]:
df_nan

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,income,family_status
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,41709,Married
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,82518,Single
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,117099,Married
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,155673,Married
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,151819,Married
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,87783,Married
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,108488,Married
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,45275,Married
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,56325,Single
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,59222,Married

In [34]:
df_cust_cleaner = df_cust_clean

In [35]:
# Replacing NaN values for 'Unknown'

df_cust_cleaner['first_name'].fillna('Unknown', inplace=True)

In [36]:
# Checking the result

df_check_unknown = df_cust_cleaner[df_cust_cleaner['first_name'] == 'Unknown']

In [37]:
# Checking the result

df_check_unknown

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,income,family_status
53,76659,Unknown,Gilbert,Male,Colorado,26,1/1/2017,2,41709,Married
73,13738,Unknown,Frost,Female,Louisiana,39,1/1/2017,0,82518,Single
82,89996,Unknown,Dawson,Female,Oregon,52,1/1/2017,3,117099,Married
99,96166,Unknown,Oconnor,Male,Oklahoma,51,1/1/2017,1,155673,Married
105,29778,Unknown,Dawson,Female,Utah,63,1/1/2017,3,151819,Married
...,...,...,...,...,...,...,...,...,...,...
206038,121317,Unknown,Melton,Male,Pennsylvania,28,3/31/2020,3,87783,Married
206044,200799,Unknown,Copeland,Female,Hawaii,52,4/1/2020,2,108488,Married
206090,167394,Unknown,Frost,Female,Hawaii,61,4/1/2020,1,45275,Married
206162,187532,Unknown,Floyd,Female,California,39,4/1/2020,0,56325,Single
206171,116898,Unknown,Delgado,Female,Colorado,23,4/1/2020,2,59222,Married

In [38]:
# Checking for duplicate rows, there are none. 

df_dups = df_cust_cleaner[df_cust_cleaner.duplicated()]

In [39]:
df_dups.shape

(0, 10)

In [40]:
# Checking for mixed-type data; returning nothing, therefore I assume there is no mixed-type data.

for col in df_cust_cleaner.columns.tolist():
  weird = (df_cust_cleaner[[col]].applymap(type) != df_cust_cleaner[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust_cleaner[weird]) > 0:
    print (col)

## 6. Combining Data

> D6: Combine your customer data with the rest of your prepared Instacart data. Tip: Make sure the key columns are of the same data type!

In [41]:
# Importing dataframe 'orders_products_group_agg.pkl' to combine with new dataframe
df_ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_group_agg.pkl'))

In [42]:
# Checking which column to use to combine the dataframes

df_ords_prods.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_spent,spender_flag,median_order_freq,order_freq_flag
0,2539329,1,prior,1,2,8,0.0,196,1,0,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
1,2539329,1,prior,1,2,8,0.0,14084,2,0,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
2,2539329,1,prior,1,2,8,0.0,12427,3,0,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
3,2539329,1,prior,1,2,8,0.0,26088,4,0,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer
4,2539329,1,prior,1,2,8,0.0,26405,5,0,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.0,Regular customer

In [43]:
# The common column is 'user_id'

df_cust_cleaner.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,income,family_status
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,165665,Married
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,59285,Single
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,99568,Married
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,42049,Single
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,40374,Married

In [44]:
# I will use the column 'user_id', but need to check the data type is matching (it is not!):

df_ords_prods['user_id'].dtype

dtype('int64')

In [45]:
# Converting data type to string (as I did for the other dataframe previously)

df_ords_prods['user_id'] = df_ords_prods['user_id'].astype('str')

In [46]:
# Checking that the data type is now 'string' for both dataframes

df_ords_prods['user_id'].dtype

dtype('O')

In [47]:
df_cust_cleaner['user_id'].dtype

dtype('O')

In [48]:
# Checking the shape to know how many columns to expect once merged .

df_ords_prods.shape

(32435059, 26)

In [49]:
# Checking the shape to know how many columns to expect once merged (answer is 34).

df_cust_cleaner.shape

(206209, 10)

In [50]:
# Merging the dataframes

df_OPC = df_ords_prods.merge(df_cust_cleaner, on = ['user_id'], indicator = 'user_id_merge', how = 'left')

In [51]:
# Checking the dataframe, there are 36 columns and looks good. 

df_OPC.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,first_name,last_name,gender,state,age,date_joined,n_dependants,income,family_status,user_id_merge
0,2539329,1,prior,1,2,8,0.0,196,1,0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,40423,Married,both
1,2539329,1,prior,1,2,8,0.0,14084,2,0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,40423,Married,both
2,2539329,1,prior,1,2,8,0.0,12427,3,0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,40423,Married,both
3,2539329,1,prior,1,2,8,0.0,26088,4,0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,40423,Married,both
4,2539329,1,prior,1,2,8,0.0,26405,5,0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,40423,Married,both

In [52]:
df_OPC['user_id_merge'].value_counts()

both          32435059
left_only            0
right_only           0
Name: user_id_merge, dtype: int64

In [53]:
df_OPC.shape

(32435059, 36)

> ##### D7: Ensure your notebook contains logical titles, section headings, and descriptive code comments. (done)

## 7. Exporting Data

> <i> D8: Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [54]:
df_OPC.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers.pkl'))